In [1]:
# importando la libreria pandas

import pandas as pd

In [2]:
"""
las series son arreglos unidimencionales como las listas o los arrays
pero se pueden generar por id etiquetas
"""

serie = pd.Series([1,2,4,5,6])

In [3]:
serie

0    1
1    2
2    4
3    5
4    6
dtype: int64

In [4]:
# ejemplo creando serie con etiquetas
serie = pd.Series([1,2,4,5,6], index = ['a', 'b', 'c', 'd', 'e'])

In [5]:
serie

a    1
b    2
c    4
d    5
e    6
dtype: int64

In [7]:
# creando series a partir de diccionarios

diccionario = {'a':5, 'b':6 ,'c':89, 'd':97}

serie1 = pd.Series(diccionario)

In [8]:
serie1

a     5
b     6
c    89
d    97
dtype: int64

In [9]:
# obtener el valor de una serie pasando el valor de la etiqueta

serie1['a']

5

In [10]:
# obtener el valor de una serie pasando el valor de la posicion

serie1[3]

97

In [11]:
# obtener los valores de una serie pasando un rango de valores

serie1[2:]

c    89
d    97
dtype: int64

In [13]:
# devulve las etiquetas asignadas a una serie

serie1.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [14]:
# devulve los valores asignados a una serie

serie1.values

array([ 5,  6, 89, 97], dtype=int64)

In [15]:
# realizar operaciones con series se debe tener cuidado que tengan las mismas etiquetas

# suma de series

serie = pd.Series([1,2,4,5,6], index = ['a', 'b', 'c', 'd', 'e'])

diccionario = {'a':5, 'b':6 ,'c':89, 'd':97, 'e':15}

serie1 = pd.Series(diccionario)

resultado = serie + serie1

In [16]:
resultado

a      6
b      8
c     93
d    102
e     21
dtype: int64

In [17]:
# multiplicar todos los elementos de una serie por un valor

serie1*10

a     50
b     60
c    890
d    970
e    150
dtype: int64

In [18]:
# utilizar las opciones de numpy 
import numpy as np

In [19]:
# raiz cuadrada de la serie1
np.sqrt(serie1)

a    2.236068
b    2.449490
c    9.433981
d    9.848858
e    3.872983
dtype: float64

In [23]:
"""

Crear un dataframe es una estructura bidimencional muy parecidas a las tablas

"""

# se crea un diccionario con dos columnas se series

dic1 = {'columna1': pd.Series([1,2,4,5,6], index = ['a', 'b', 'c', 'd', 'e']),'columna2': pd.Series([8,9,10,11,12], index = ['a', 'b', 'c', 'd', 'e'])}

In [24]:
# se crea el dataframe a partir del diccionario

dataframe = pd.DataFrame(dic1)

In [25]:
dataframe

   columna1  columna2
a         1         8
b         2         9
c         4        10
d         5        11
e         6        12

In [26]:
# crear un dataframe a partir de una lista con diccionarios

lista = [{'a':1, 'b':5, 'c':7}, {'c':1, 'h':5, 'b':7}]

dataframe1 = pd.DataFrame(lista)

In [27]:
dataframe1

     a  b  c    h
0  1.0  5  7  NaN
1  NaN  7  1  5.0

In [28]:
# consultar una columna en concreto con un dataframe

dataframe1['b']

0    5
1    7
Name: b, dtype: int64

In [29]:
# agregar columnas a un dataframe

dataframe1['t'] = pd.Series([5,2], index = [0,1])

In [30]:
dataframe1

     a  b  c    h  t
0  1.0  5  7  NaN  5
1  NaN  7  1  5.0  2

In [31]:
# añadir columna al primer frame
dataframe['columna3'] = pd.Series([1,2,4,5,6], index = ['a', 'b', 'c', 'd', 'e'])

In [32]:
dataframe

   columna1  columna2  columna3
a         1         8         1
b         2         9         2
c         4        10         4
d         5        11         5
e         6        12         6

In [33]:
# eliminar una columna del dataframe

del dataframe['columna1']

In [34]:
dataframe

   columna2  columna3
a         8         1
b         9         2
c        10         4
d        11         5
e        12         6

In [36]:
# acceder a valores de una fila de un dataframe

dataframe.loc['b']

columna2    9
columna3    2
Name: b, dtype: int64

In [37]:
# acceder a valores de una fila por posicion de un dataframe

dataframe.iloc[1]

columna2    9
columna3    2
Name: b, dtype: int64

In [38]:
# seleccion de filas por array booleano

filtro = np.array([True, False, True, False, True])

In [39]:
dataframe[filtro]

   columna2  columna3
a         8         1
c        10         4
e        12         6

In [ ]:
# realizar la transpuesta de un dataframe